---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.GetFilters
source: html/6db26e07-dd4c-d1b8-1bae-621f14330af5.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.GetFilters Method

Gets all filters in this ScheduleDefinition.

## Syntax (C#)
```csharp
public IList<ScheduleFilter> GetFilters()
```

## Returns
A list of all filters.